import React from "react";
import { Card, Modal, Button, Icon } from "antd";

const LicenceBox = props => {
  const handleOnClose = () => {
    props.parentCallback(false);
  };

  return (
    <Modal
      title={
        <div style={{ display: "flex" }}>
          <div style={{ fontSize: "1.5rem", position: "absolute" }}>
            Disclaimer
          </div>
          <div style={{ marginLeft: 240 }}>
            <Icon type="close" onClick={handleOnClose} />
          </div>
        </div>
      }
      closable={false}
      width={600}
      visible={props.visible}
      footer={null}
    >
      <div className="center-h">
        <div className="center-h">
          ข้อตกลงการใช้งานซอฟต์แวร์ ซอฟต์แวร์นี้เป็นผลงานที่พัมนาขึ้นโดย
          นายภูวเนศวร์ แย้มวิเศษ นายสุวัจย์ ยืมกระโทก และนางสาวตรีเนตร
          น้อยหัวหาดจากมหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน
          ภายใต้การดูแลของอาจารย์เอกลักษ์ ฉิมจารย์ ภายใต้โครงการ
          การประยุกต์บล็อกเชนกับการเลือกตั้งของประเทศไทย ซึ่งสนับสนุนโดย
          สำนักงานพัฒนาสิทยาศาสตร์และเทคโนโลยีแห่งชาติ
          โดยมีวัตถุประสงค์เพื่อส่งเสริมให้นักเรียนและนักศึกษาได้เรียนรู้และฝึกทักษะในการพัฒนาซอฟต์แวร์
          บิขสิทธิ์ของซอฟต์แวร์นี้จึงเป็นของผู้พัฒนา
          ซึ่งผู้พัฒนาได้อนุญาติให้สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ
          เผยแพร่ซอฟต์แวร์นี้ตาม "ต้นฉบับ" โดยไม่มีการแก้ไขดัดแปลงใด ๆ ทั้งสิ้น
          ให้แก่บุคคลทั่วไปได้ใช้เพื่อประโยชน์ส่วนบุคคลหรือประโยชน์ทางการศึกษาที่ไม่มีวัตถุประสงค์ในเชิงพาณิชย์
          โดยไม่คิดค่าตอบแทนการใช้ซอฟต์แวร์ ดังนั้น
          สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ จึงไม่มีหน้าที่ในการดูแล
          บำรุงรักษา จัดการอบรมการใช้งาน หรือพัฒนาประสิทธิภาพซอฟต์แวร์
          รวมทั้งไม่รับรองความถูกต้องหรือประสิทธิภาพการทำงานของซอฟต์แวร์
          ตลอดจนไม่รับประกันความเสียหายต่าง ๆ
          อันเกิดจากการใช้ซอฟต์แวร์นี้ทั้งสิ้น
        </div>
      </div>
    </Modal>
  );
};

export default LicenceBox;
